nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_application.svd
        <register>
          <name>TRCVIPCSSCTLR</name>
          <description>Use this to set, or read, which PE comparator inputs can control the ViewInst start/stop logic. Might ignore writes when the trace unit is enabled or not idle. If implemented then this register must be programmed.</description>
          <addressOffset>0x08C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>START_0</name>
              <description>Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting trace</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single PE comparator input 0, is not selected as a start resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single PE comparator input 0, is selected as a start resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START_1</name>
              <description>Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting trace</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single PE comparator input 1, is not selected as a start resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single PE comparator input 1, is selected as a start resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START_2</name>
              <description>Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting trace</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single PE comparator input 2, is not selected as a start resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single PE comparator input 2, is selected as a start resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START_3</name>
              <description>Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting trace</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single PE comparator input 3, is not selected as a start resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single PE comparator input 3, is selected as a start resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START_4</name>
              <description>Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting trace</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single PE comparator input 4, is not selected as a start resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single PE comparator input 4, is selected as a start resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START_5</name>
              <description>Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting trace</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single PE comparator input 5, is not selected as a start resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single PE comparator input 5, is selected as a start resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START_6</name>
              <description>Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting trace</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single PE comparator input 6, is not selected as a start resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single PE comparator input 6, is selected as a start resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START_7</name>
              <description>Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting trace</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single PE comparator input 7, is not selected as a start resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single PE comparator input 7, is selected as a start resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_0</name>
              <description>Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping trace.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single PE comparator input 0, is not selected as a stop resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single PE comparator input 0, is selected as a stop resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_1</name>
              <description>Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping trace.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single PE comparator input 1, is not selected as a stop resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single PE comparator input 1, is selected as a stop resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_2</name>
              <description>Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping trace.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single PE comparator input 2, is not selected as a stop resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single PE comparator input 2, is selected as a stop resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_3</name>
              <description>Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping trace.</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single PE comparator input 3, is not selected as a stop resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single PE comparator input 3, is selected as a stop resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_4</name>
              <description>Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping trace.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single PE comparator input 4, is not selected as a stop resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single PE comparator input 4, is selected as a stop resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_5</name>
              <description>Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping trace.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single PE comparator input 5, is not selected as a stop resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single PE comparator input 5, is selected as a stop resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_6</name>
              <description>Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping trace.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single PE comparator input 6, is not selected as a stop resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single PE comparator input 6, is selected as a stop resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_7</name>
              <description>Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping trace.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single PE comparator input 7, is not selected as a stop resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single PE comparator input 7, is selected as a stop resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
