nrfconnect/sdk-hal_nordic/nrfx/bsp/stable/mdk/nrf54lm20a_enga_application.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_USBHS_NS</name>
      <description>USBHS 0</description>
      <baseAddress>0x4005A000</baseAddress>
      <headerStructName>USBHS</headerStructName>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USBHS</name>
        <value>90</value>
      </interrupt>
      <groupName>USBHS</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Start the USB peripheral.</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_START</name>
              <description>Start the USB peripheral.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stop the USB peripheral</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_STOP</name>
              <description>Stop the USB peripheral</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_SOF</name>
          <description>Publish configuration for SOF event.</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel to publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <description>Enable publishing of SOF event</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>Enable USB peripheral.</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE</name>
              <description>Enable USB Controller</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>USB Controller disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>USB Controller enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHY</name>
              <description>Enable USB PHY</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>USB PHY disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>USB PHY enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>PHY</name>
          <description>Unspecified</description>
          <headerStructName>USBHS_PHY</headerStructName>
          <access>read-write</access>
          <addressOffset>0x440</addressOffset>
          <register>
            <name>CONFIG</name>
            <description>USB PHY parameter overrides</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x5533D6F0</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PLLITUNE</name>
                <description>PLL Integral Path Tune</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>PLLPTUNE</name>
                <description>PLL Proportional Path Tune</description>
                <lsb>2</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>COMPDISTUNE0</name>
                <description>Disconnect Threshold Adjustment</description>
                <lsb>6</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>SQRXTUNE0</name>
                <description>Squelch Threshold Adjustment</description>
                <lsb>9</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>VDATREFTUNE0</name>
                <description>Data Detect Voltage Adjustment</description>
                <lsb>12</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>TXHSXVTUNE0</name>
                <description>Transmitter High-Speed Crossover Adjustment</description>
                <lsb>14</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>TXFSLSTUNE0</name>
                <description>FS/LS Source Impedance Adjustment</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>TXVREFTUNE0</name>
                <description>HS DC Voltage Level Adjustment</description>
                <lsb>20</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>TXRISETUNE0</name>
                <description>HS Transmitter Rise/Fall Time Adjustment</description>
                <lsb>24</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>TXRESTUNE0</name>
                <description>USB Source Impedance Adjustment</description>
                <lsb>26</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>TXPREEMPAMPTUNE0</name>
                <description>HS Transmitter Pre-Emphasis Current Control</description>
                <lsb>28</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>TXPREEMPPULSETUNE0</name>
                <description>HS Transmitter Pre-Emphasis Duration Control</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CLOCK</name>
            <description>USB PHY clock configurations</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000001A</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FSEL</name>
                <description>Select reference clock frequency</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clock19200KHz</name>
                    <description>Reference clock is 19.2MHz.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Clock20000KHz</name>
                    <description>Reference clock is 20MHz.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Clock24000KHz</name>
                    <description>Reference clock is 24MHz.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Clock50000KHz</name>
                    <description>Reference clock is 50MHz.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLLBTUNE</name>
                <description>PLL bandwidth adjustment</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>PLL bandwidth adjustment disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>PLL bandwidth adjustment enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>COMMONONN</name>
                <description>Common block power down control</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>POWERED</name>
                    <description>The REFCLOCK_LOGIC,bias and PLL blocks are powered in sleep or suspend mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUSPEND</name>
                    <description>The REFCLOCK_LOGIC, bias and PLL blocks are powered down in suspend mode and bias and PLL
          blocks are powered down in sleep mode.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>INPUTOVERRIDE</name>
            <description>Enables overriding of individual signals to the PHY, the override values are set in PHY.OVERRIDEVALUES</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DPPULLDOWN</name>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>DMPULLDOWN</name>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>VBUSVALID</name>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>ID</name>
                <description>Overrides OTG ID pin signal</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>OVERRIDEVALUES</name>
            <description>Values that are used to override the input signals to the PHY.</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DPPULLDOWN</name>
                <description>This field controls the pull-down resistor on D+</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>The pull-down resistor on D+ is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>The pull-down resistor on D+ is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMPULLDOWN</name>
                <description>This field controls the pull-down resistor on D-</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>The pull-down resistor on D- is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>The pull-down resistor on D- is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VBUSVALID</name>
                <description>Signals to the PHY that VBUS is valid, and enables the pull-up resistor on D+</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Valid</name>
                    <description>VBUS is valid, and the pull up resistor on D+ is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NotValid</name>
                    <description>VBUS is not valid, and the pull up resistor on D+ is disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ID</name>
                <description>Overrides OTG ID pin signal</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Device</name>
                    <description>Role is Device</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Host</name>
                    <description>Role is Host.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RTUNE</name>
            <description>The RTUNE mode is an alternative method for calibrating the DP and DM 45-Ohm source impedance.</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000000F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RTUNESEL</name>
                <description>This signal selects the tuning method for the high-speed DP and DM source impedance of the USBHS.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TXRTUNE</name>
                    <description>The TXRTUNE pin, external resistor REXT, and resulting internal
              digital calibration code are used for tuning the high-speed source
              impedance.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RTUNE</name>
                    <description>The RCALCODE value is used for tuning the high-speed source impedance.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RCALCODE</name>
                <description>This signal is used to tune the internal 200 ohm resistor or the USBHS DP and DM high-speed source impedance.</description>
                <lsb>1</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
        </cluster>
